Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/spi/aiio_spi.c
/** @brief      SPI application interface.
 *
 *  @file       aiio_spi.c
 *  @copyright  Copyright (C) 2020-2023, Shenzhen Anxinke Technology Co., Ltd
 *  @note       SPI application interface.
 *  @par        Change Logs:
 *  <table>
 *  <tr><th>Date            <th>Version     <th>Author      <th>Notes
 *  <tr><td>2023/02/07      <td>1.0.0       <td>liq         <td>spi init
 *  </table>
 *
 */
#include "aiio_spi.h"
#include <string.h>
#include <stdio.h>
#include <device/vfs_spi.h>
#include <vfs_err.h>
#include <vfs_register.h>
#include <aos/kernel.h>

#include <bl_dma.h>
#include <bl_gpio.h>
#include <bl602_spi.h>
#include <bl602_gpio.h>
#include <bl602_glb.h>
#include <bl602_dma.h>
#include <bl602.h>
#include <bl_irq.h>
#include <bl_dma.h>
#include <bl_gpio.h>
#include <hosal_dma.h>
// #include <hosal_spi.h>

#include <FreeRTOS.h>
#include <task.h>
#include <timers.h>
#include <event_groups.h>

#include <libfdt.h>
#include <utils_log.h>
#include <blog.h>

#include <event_groups.h>

#define AIIO_FUNC_FAIL -3

#define HOSAL_SPI_MODE_MASTER 0        /**< spi communication is master mode */
#define HOSAL_SPI_MODE_SLAVE 1         /**< spi communication is slave mode */
#define HOSAL_WAIT_FOREVER 0xFFFFFFFFU /**< DMA transmission timeout */

typedef void (*hosal_spi_irq_t)(void *parg); /**< spi irq callback function */

/**
 * @brief Define spi config args
 */
typedef struct
{
    uint8_t mode;        /**< spi communication mode */
    uint8_t dma_enable;  /**< enable dma tansmission or not */
    uint8_t polar_phase; /**< spi polar and phase */
    uint32_t freq;       /**< communication frequency Hz */
    uint8_t pin_cs;
    uint8_t pin_clk;  /**< spi clk pin */
    uint8_t pin_mosi; /**< spi mosi pin */
    uint8_t pin_miso; /**< spi miso pin */
} hosal_spi_config_t;

/**
 * @brief Define spi dev handle
 */
typedef struct
{
    uint8_t port;              /**< spi port */
    hosal_spi_config_t config; /**< spi config */
    hosal_spi_irq_t cb;        /**< spi interrupt callback */
    void *p_arg;               /**< arg pass to callback */
    void *priv;                /**< priv data */
} hosal_spi_dev_t;

#define LLI_BUFF_SIZE 2048

#define EVT_GROUP_SPI_TX (1 << 0)
#define EVT_GROUP_SPI_RX (1 << 1)
#define EVT_GROUP_SPI_TR (EVT_GROUP_SPI_TX | EVT_GROUP_SPI_RX)

static void hosal_spi_int_handler_tx(void *arg, uint32_t flag);
static void hosal_spi_int_handler_rx(void *arg, uint32_t flag);
static void spi_irq_process(void *p_arg);

typedef struct
{
    uint8_t *tx_data;
    uint8_t *rx_data;
    uint32_t length;
    uint32_t tx_index;
    uint32_t rx_index;
    EventGroupHandle_t spi_event_group;
} spi_priv_t;

typedef struct
{
    int8_t tx_dma_ch;
    int8_t rx_dma_ch;
    uint8_t rx_enable;
    EventGroupHandle_t spi_event_group;
} spi_dma_priv_t;

static void spi_basic_init(hosal_spi_dev_t *arg)
{
    hosal_spi_dev_t *hw_arg = arg;
    SPI_CFG_Type spicfg;
    SPI_FifoCfg_Type fifocfg;
    SPI_ID_Type spi_id; // TODO change SPI_ID_Type

    spi_id = hw_arg->port;

    SPI_SetClock(spi_id, hw_arg->config.freq);

    /* spi config */
    spicfg.deglitchEnable = DISABLE;
    spicfg.continuousEnable = ENABLE;
    spicfg.byteSequence = SPI_BYTE_INVERSE_BYTE0_FIRST,
    spicfg.bitSequence = SPI_BIT_INVERSE_MSB_FIRST,
    spicfg.frameSize = SPI_FRAME_SIZE_8;

    if (hw_arg->config.polar_phase == 0)
    {
        spicfg.clkPhaseInv = SPI_CLK_PHASE_INVERSE_0;
        spicfg.clkPolarity = SPI_CLK_POLARITY_LOW;
    }
    else if (hw_arg->config.polar_phase == 1)
    {
        spicfg.clkPhaseInv = SPI_CLK_PHASE_INVERSE_1;
        spicfg.clkPolarity = SPI_CLK_POLARITY_LOW;
    }
    else if (hw_arg->config.polar_phase == 2)
    {
        spicfg.clkPhaseInv = SPI_CLK_PHASE_INVERSE_0;
        spicfg.clkPolarity = SPI_CLK_POLARITY_HIGH;
    }
    else if (hw_arg->config.polar_phase == 3)
    {
        spicfg.clkPhaseInv = SPI_CLK_PHASE_INVERSE_1;
        spicfg.clkPolarity = SPI_CLK_POLARITY_HIGH;
    }
    else
    {
        blog_error("node support polar_phase \r\n");
    }
    SPI_Init(0, &spicfg);

    if (hw_arg->config.mode == 0)
    {
        SPI_Disable(spi_id, SPI_WORK_MODE_MASTER);
    }
    else
    {
        SPI_Disable(spi_id, SPI_WORK_MODE_SLAVE);
    }

    SPI_IntMask(spi_id, SPI_INT_ALL, MASK);

    /* fifo */
    fifocfg.txFifoThreshold = 1;
    fifocfg.rxFifoThreshold = 1;
    if (hw_arg->config.dma_enable)
    {
        fifocfg.txFifoDmaEnable = ENABLE;
        fifocfg.rxFifoDmaEnable = ENABLE;
        SPI_FifoConfig(spi_id, &fifocfg);
    }
    else
    {
        fifocfg.txFifoDmaEnable = DISABLE;
        fifocfg.rxFifoDmaEnable = DISABLE;
        SPI_FifoConfig(spi_id, &fifocfg);
        bl_irq_register_with_ctx(SPI_IRQn, spi_irq_process, (void *)hw_arg);
        blog_info("spi no dma mode\r\n");
    }
}

static int lli_list_init(DMA_LLI_Ctrl_Type **pptxlli, DMA_LLI_Ctrl_Type **pprxlli, uint8_t *ptx_data, uint8_t *prx_data, uint32_t length)
{
    uint32_t i = 0;
    uint32_t count;
    uint32_t remainder;
    struct DMA_Control_Reg dmactrl;

    count = length / LLI_BUFF_SIZE;
    remainder = length % LLI_BUFF_SIZE;

    if (remainder != 0)
    {
        count = count + 1;
    }

    dmactrl.SBSize = DMA_BURST_SIZE_1;
    dmactrl.DBSize = DMA_BURST_SIZE_1;
    dmactrl.SWidth = DMA_TRNS_WIDTH_8BITS;
    dmactrl.DWidth = DMA_TRNS_WIDTH_8BITS;
    dmactrl.Prot = 0;
    dmactrl.SLargerD = 0;

    *pptxlli = pvPortMalloc(sizeof(DMA_LLI_Ctrl_Type) * count);
    if (*pptxlli == NULL)
    {
        blog_error("malloc lli failed. \r\n");

        return -1;
    }

    if (NULL != prx_data)
    {
        *pprxlli = pvPortMalloc(sizeof(DMA_LLI_Ctrl_Type) * count);
        if (*pprxlli == NULL)
        {
            blog_error("malloc lli failed.");
            vPortFree(*pptxlli);
            return -1;
        }
    }

    for (i = 0; i < count; i++)
    {
        if (remainder == 0)
        {
            dmactrl.TransferSize = LLI_BUFF_SIZE;
        }
        else
        {
            if (i == count - 1)
            {
                dmactrl.TransferSize = remainder;
            }
            else
            {
                dmactrl.TransferSize = LLI_BUFF_SIZE;
            }
        }

        if (i == count - 1)
        {
            dmactrl.I = 1;
        }
        else
        {
            dmactrl.I = 0;
        }

        if (NULL != ptx_data)
        {
            dmactrl.SI = DMA_MINC_ENABLE;
            dmactrl.DI = DMA_MINC_DISABLE;
            (*pptxlli)[i].srcDmaAddr = (uint32_t)(ptx_data + i * LLI_BUFF_SIZE);
            (*pptxlli)[i].destDmaAddr = (uint32_t)(SPI_BASE + SPI_FIFO_WDATA_OFFSET);
            (*pptxlli)[i].dmaCtrl = dmactrl;
            if (i != 0)
            {
                (*pptxlli)[i - 1].nextLLI = (uint32_t) & (*pptxlli)[i];
            }
            (*pptxlli)[i].nextLLI = 0;
        }

        if (NULL != prx_data)
        {
            dmactrl.SI = DMA_MINC_DISABLE;
            dmactrl.DI = DMA_MINC_ENABLE;
            (*pprxlli)[i].srcDmaAddr = (uint32_t)(SPI_BASE + SPI_FIFO_RDATA_OFFSET);
            (*pprxlli)[i].destDmaAddr = (uint32_t)(prx_data + i * LLI_BUFF_SIZE);
            (*pprxlli)[i].dmaCtrl = dmactrl;
            if (i != 0)
            {
                (*pprxlli)[i - 1].nextLLI = (uint32_t) & (*pprxlli)[i];
            }
            (*pprxlli)[i].nextLLI = 0;
        }
    }

