Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/spi/aiio_spi.c
    return 0;
}

static int hosal_spi_dma_trans(hosal_spi_dev_t *arg, uint8_t *TxData, uint8_t *RxData, uint32_t Len, uint32_t timeout)
{
    EventBits_t uxBits;
    DMA_LLI_Cfg_Type txllicfg;
    DMA_LLI_Cfg_Type rxllicfg;
    DMA_LLI_Ctrl_Type *ptxlli = NULL;
    DMA_LLI_Ctrl_Type *prxlli = NULL;
    spi_dma_priv_t *dma_arg = (spi_dma_priv_t *)arg->priv;
    int ret;

    if (!arg)
    {
        blog_error("arg err.\r\n");
        return -1;
    }

    if (TxData)
    {
        if (dma_arg->tx_dma_ch == -1)
        {
            dma_arg->tx_dma_ch = hosal_dma_chan_request(0);
            if (dma_arg->tx_dma_ch < 0)
            {
                blog_error("SPI TX DMA CHANNEL get failed!\r\n");
                return -1;
            }
        }
    }
    else
    {
        dma_arg->tx_dma_ch = -1;
    }
    if (RxData)
    {
        if (dma_arg->rx_dma_ch == -1)
        {
            dma_arg->rx_dma_ch = hosal_dma_chan_request(0);
            if (dma_arg->rx_dma_ch < 0)
            {
                blog_error("SPI RX DMA CHANNEL get failed!\r\n");
                return -1;
            }
        }
    }
    else
    {
        dma_arg->rx_dma_ch = -1;
    }

    txllicfg.dir = DMA_TRNS_M2P;
    txllicfg.srcPeriph = DMA_REQ_NONE;
    txllicfg.dstPeriph = DMA_REQ_SPI_TX;

    rxllicfg.dir = DMA_TRNS_P2M;
    rxllicfg.srcPeriph = DMA_REQ_SPI_RX;
    rxllicfg.dstPeriph = DMA_REQ_NONE;

    xEventGroupClearBits(dma_arg->spi_event_group, EVT_GROUP_SPI_TR);

    if (arg->config.mode == 0)
    {
        SPI_Enable(arg->port, SPI_WORK_MODE_MASTER);
    }
    else
    {
        SPI_Enable(arg->port, SPI_WORK_MODE_SLAVE);
    }

    ret = lli_list_init(&ptxlli, &prxlli, TxData, RxData, Len);
    if (ret < 0)
    {
        blog_error("init lli failed. \r\n");

        return -1;
    }

    if (NULL != RxData)
    {
        hosal_dma_irq_callback_set(dma_arg->rx_dma_ch, hosal_spi_int_handler_rx, arg);
        DMA_LLI_Init(dma_arg->rx_dma_ch, &rxllicfg);
        DMA_LLI_Update(dma_arg->rx_dma_ch, (uint32_t)prxlli);
        hosal_dma_chan_start(dma_arg->rx_dma_ch);
    }

    if (NULL != TxData)
    {
        hosal_dma_irq_callback_set(dma_arg->tx_dma_ch, hosal_spi_int_handler_tx, arg);
        DMA_LLI_Init(dma_arg->tx_dma_ch, &txllicfg);
        DMA_LLI_Update(dma_arg->tx_dma_ch, (uint32_t)ptxlli);
        hosal_dma_chan_start(dma_arg->tx_dma_ch);
    }

    uxBits = xEventGroupWaitBits(dma_arg->spi_event_group,
                                 EVT_GROUP_SPI_TR,
                                 pdTRUE,
                                 pdTRUE,
                                 timeout);

    if ((uxBits & EVT_GROUP_SPI_TR) == EVT_GROUP_SPI_TR)
    {
        if (dma_arg->tx_dma_ch >= 0)
        {
            hosal_dma_chan_stop(dma_arg->tx_dma_ch);
            hosal_dma_chan_release(dma_arg->tx_dma_ch);
            dma_arg->tx_dma_ch = -1;
        }
        if (dma_arg->rx_dma_ch >= 0)
        {
            hosal_dma_chan_stop(dma_arg->rx_dma_ch);
            hosal_dma_chan_release(dma_arg->rx_dma_ch);
            dma_arg->rx_dma_ch = -1;
        }
        if (arg->cb)
        {
            arg->cb(arg->p_arg);
        }
    }
    else
    {
        blog_error(" trans timeout\r\n");
    }

    vPortFree(ptxlli);
    if (NULL != RxData)
    {
        vPortFree(prxlli);
    }
    return 0;
}

static void hosal_spi_int_handler_tx(void *arg, uint32_t flag)
{
    BaseType_t xResult = pdFAIL;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    hosal_spi_dev_t *dev = (hosal_spi_dev_t *)arg;
    if (NULL != dev)
    {
        if (dev->config.dma_enable)
        {
            spi_dma_priv_t *priv = (spi_dma_priv_t *)dev->priv;
            bl_dma_int_clear(priv->tx_dma_ch);
            if (priv->spi_event_group != NULL)
            {
                xResult = xEventGroupSetBitsFromISR(priv->spi_event_group,
                                                    EVT_GROUP_SPI_TX,
                                                    &xHigherPriorityTaskWoken);

                if (priv->rx_dma_ch == -1)
                {
                    xEventGroupSetBitsFromISR(priv->spi_event_group,
                                              EVT_GROUP_SPI_RX,
                                              &xHigherPriorityTaskWoken);
                }
            }

            if (xResult != pdFAIL)
            {
                portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
            }
        }
    }
    else
    {
        blog_error("hosal_spi_int_handler_tx no clear isr.\r\n");
    }
    return;
}

static void hosal_spi_int_handler_rx(void *arg, uint32_t flag)
{
    BaseType_t xResult = pdFAIL;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    hosal_spi_dev_t *dev = (hosal_spi_dev_t *)arg;
    if (NULL != dev)
    {
        if (dev->config.dma_enable)
        {
            spi_dma_priv_t *priv = (spi_dma_priv_t *)dev->priv;
            bl_dma_int_clear(priv->tx_dma_ch);
            if (priv->spi_event_group != NULL)
            {
                xResult = xEventGroupSetBitsFromISR(priv->spi_event_group, EVT_GROUP_SPI_RX, &xHigherPriorityTaskWoken);

                if (priv->tx_dma_ch == -1)
                {
                    xEventGroupSetBitsFromISR(priv->spi_event_group, EVT_GROUP_SPI_TX, &xHigherPriorityTaskWoken);
                }
            }

            if (xResult != pdFAIL)
            {
                portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
            }
        }
    }
    else
    {
        blog_error("hosal_spi_int_handler_tx no clear isr.\r\n");
    }
    return;
}

static void spi_irq_process(void *p_arg)
{
    BaseType_t xResult = pdFAIL;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    hosal_spi_dev_t *spi = (hosal_spi_dev_t *)p_arg;
    spi_priv_t *spi_priv = (spi_priv_t *)spi->priv;
    uint32_t tmpVal;
    uint32_t SPIx = SPI_BASE;
    hosal_spi_irq_t pfn;
    void *parg;
    pfn = spi->cb;
    parg = spi->p_arg;

    tmpVal = BL_RD_REG(SPIx, SPI_INT_STS);
    if (BL_IS_REG_BIT_SET(tmpVal, SPI_END_INT) && !BL_IS_REG_BIT_SET(tmpVal, SPI_CR_SPI_END_MASK))
    {
        BL_WR_REG(SPIx, SPI_INT_STS, BL_SET_REG_BIT(tmpVal, SPI_CR_SPI_END_CLR));
    }
    /* TX fifo ready interrupt(fifo count > fifo threshold) */
    if (BL_IS_REG_BIT_SET(tmpVal, SPI_TXF_INT) && !BL_IS_REG_BIT_SET(tmpVal, SPI_CR_SPI_TXF_MASK))
    {
        if (spi_priv->tx_data)
        {
            if (spi_priv->tx_index < spi_priv->length)
            {
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, (uint32_t)spi_priv->tx_data[spi_priv->tx_index]);
                spi_priv->tx_index++;
            }
            else
            {
            }
        }
        else
        { /* send 0 while only recv */
            if (spi_priv->tx_index < spi_priv->length)
            {
                BL_WR_REG(SPIx, SPI_FIFO_WDATA, 0);
                spi_priv->tx_index++;
            }
            else
            {
            }
        }
    }
    /*  RX fifo ready interrupt(fifo count > fifo threshold) */
    if (BL_IS_REG_BIT_SET(tmpVal, SPI_RXF_INT) && !BL_IS_REG_BIT_SET(tmpVal, SPI_CR_SPI_RXF_MASK))
    {
        if (spi_priv->rx_data)
        {
            spi_priv->rx_data[spi_priv->rx_index] = (uint8_t)(BL_RD_REG(SPIx, SPI_FIFO_RDATA) & 0xff);
            spi_priv->rx_index++;
            if (spi_priv->rx_index == spi_priv->length)
            {
                /* spi callback */
                if (pfn)
                {
                    pfn(parg);
                }
                bl_irq_disable(SPI_IRQn);
                xResult = xEventGroupSetBitsFromISR(spi_priv->spi_event_group, EVT_GROUP_SPI_TX, &xHigherPriorityTaskWoken);
                xEventGroupSetBitsFromISR(spi_priv->spi_event_group, EVT_GROUP_SPI_RX, &xHigherPriorityTaskWoken);
                if (xResult != pdFAIL)
                {
                    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
                }
            }
        }
        else
        {
            spi_priv->rx_index++;
            if (spi_priv->rx_index == spi_priv->length)
            {
                /* spi callback */
                if (pfn)
                {
                    pfn(parg);
                }
                bl_irq_disable(SPI_IRQn);
                xResult = xEventGroupSetBitsFromISR(spi_priv->spi_event_group, EVT_GROUP_SPI_TX, &xHigherPriorityTaskWoken);
                xEventGroupSetBitsFromISR(spi_priv->spi_event_group, EVT_GROUP_SPI_RX, &xHigherPriorityTaskWoken);
                if (xResult != pdFAIL)
                {
                    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
                }
            }
        }
    }
    /* Slave mode transfer time-out interrupt,triggered when bus is idle for the given value */
    if (BL_IS_REG_BIT_SET(tmpVal, SPI_STO_INT) && !BL_IS_REG_BIT_SET(tmpVal, SPI_CR_SPI_STO_MASK))
    {
        BL_WR_REG(SPIx, SPI_INT_STS, BL_SET_REG_BIT(tmpVal, SPI_CR_SPI_STO_CLR));
        blog_info(" slave timeout\r\n");
    }
    /* Slave mode tx underrun error interrupt,trigged when tx is not ready during transfer */
    if (BL_IS_REG_BIT_SET(tmpVal, SPI_TXU_INT) && !BL_IS_REG_BIT_SET(tmpVal, SPI_CR_SPI_TXU_MASK))
    {
        BL_WR_REG(SPIx, SPI_INT_STS, BL_SET_REG_BIT(tmpVal, SPI_CR_SPI_TXU_CLR));
        blog_info(" slave tx underrun error\r\n");
    }
    /* TX/RX fifo overflow/underflow interrupt */
    if (BL_IS_REG_BIT_SET(tmpVal, SPI_FER_INT) && !BL_IS_REG_BIT_SET(tmpVal, SPI_CR_SPI_FER_MASK))
    {
        blog_info(" tx/rx overfloe/underflow\r\n");
    }
}

static int hosal_spi_trans(hosal_spi_dev_t *spi, uint8_t *tx_data, uint8_t *rx_data, uint32_t length, uint32_t timeout)
{
    if (!spi)
    {
        blog_error("arg error\r\n");
        return -1;
    }
    EventBits_t uxBits;
    spi_priv_t *spi_priv = (spi_priv_t *)spi->priv;
    blog_info("spi trans\r\n");
    uint32_t tmpVal;
    uint32_t SPIx = SPI_BASE;
    SPI_ID_Type spi_id; // TODO change SPI_ID_Type
    spi_id = spi->port;

    spi_priv->tx_data = tx_data;
    spi_priv->rx_data = rx_data;
    spi_priv->length = length;
    spi_priv->tx_index = 0;
    spi_priv->rx_index = 0;

    /* Set valid width for each fifo entry */
    tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
    BL_WR_REG(SPIx, SPI_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, SPI_CR_SPI_FRAME_SIZE, 0));

