Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/spi/aiio_spi.c
    /* Disable rx ignore */
    tmpVal = BL_RD_REG(SPIx, SPI_CONFIG);
    BL_WR_REG(SPIx, SPI_CONFIG, BL_CLR_REG_BIT(tmpVal, SPI_CR_SPI_RXD_IGNR_EN));

    /* Clear tx and rx fifo */
    tmpVal = BL_RD_REG(SPIx, SPI_FIFO_CONFIG_0);
    tmpVal = BL_SET_REG_BIT(tmpVal, SPI_TX_FIFO_CLR);
    tmpVal = BL_SET_REG_BIT(tmpVal, SPI_RX_FIFO_CLR);
    BL_WR_REG(SPIx, SPI_FIFO_CONFIG_0, tmpVal);

    if (spi->config.mode == 0)
    {
        SPI_Enable(spi->port, SPI_WORK_MODE_MASTER);
    }
    else
    {
        SPI_Enable(spi->port, SPI_WORK_MODE_SLAVE);
    }

    SPI_IntMask(spi_id, SPI_INT_ALL, UNMASK);
    bl_irq_enable(SPI_IRQn);
    uxBits = xEventGroupWaitBits(spi_priv->spi_event_group, EVT_GROUP_SPI_TR, pdTRUE, pdTRUE, timeout);

    if ((uxBits & EVT_GROUP_SPI_TR) == EVT_GROUP_SPI_TR)
    {
        blog_info("recv all event group.\r\n");
    }
    else
    {
        blog_error(" transimission timeout\r\n");
    }
    return 0;
}

static void hosal_spi_gpio_init(hosal_spi_dev_t *arg)
{

    if (!arg)
    {
        blog_error("arg err.\r\n");
        return;
    }

    GLB_GPIO_Type gpiopins[4];
    gpiopins[0] = arg->config.pin_cs; // pin cs
    gpiopins[1] = arg->config.pin_clk;
    gpiopins[2] = arg->config.pin_mosi;
    gpiopins[3] = arg->config.pin_miso;
    GLB_GPIO_Func_Init(GPIO_FUN_SPI, gpiopins, sizeof(gpiopins) / sizeof(gpiopins[0]));

    if (arg->config.mode == 0)
    {
        GLB_Set_SPI_0_ACT_MOD_Sel(GLB_SPI_PAD_ACT_AS_MASTER);
    }
    else
    {
        GLB_Set_SPI_0_ACT_MOD_Sel(GLB_SPI_PAD_ACT_AS_SLAVE);
    }

    return;
}

static int hosal_spi_init(hosal_spi_dev_t *spi)
{
    hosal_spi_dev_t *dev = spi;
    if (!spi)
    {
        blog_error("arg err.\r\n");
    }
    hosal_spi_gpio_init(dev);
    spi_basic_init(dev);
    if (dev->config.dma_enable)
    {
        spi_dma_priv_t *priv = (spi_dma_priv_t *)pvPortMalloc(sizeof(spi_dma_priv_t));
        priv->spi_event_group = xEventGroupCreate();
        priv->tx_dma_ch = -1;
        priv->rx_dma_ch = -1;
        dev->priv = priv;
    }
    else
    {
        spi_priv_t *priv = (spi_priv_t *)pvPortMalloc(sizeof(spi_priv_t));
        priv->spi_event_group = xEventGroupCreate();
        priv->tx_data = NULL;
        priv->rx_data = NULL;
        priv->length = 0;
        priv->tx_index = 0;
        priv->rx_index = 0;
        dev->priv = priv;
    }
    return 0;
}

static int hosal_spi_set_cs(uint8_t pin, uint8_t value)
{
    bl_gpio_enable_output(pin, 1, 0);
    bl_gpio_output_set(pin, value);
    return 0;
}

static int hosal_spi_irq_callback_set(hosal_spi_dev_t *spi, hosal_spi_irq_t pfn, void *p_arg)
{
    if (spi == NULL)
    {
        return -1;
    }
    spi->cb = pfn;
    spi->p_arg = p_arg;
    return 0;
}

static int hosal_spi_finalize(hosal_spi_dev_t *spi)
{
    if (spi == NULL)
    {
        return -1;
    }

    if (spi->config.dma_enable)
    {
        spi_dma_priv_t *spi_priv = (spi_dma_priv_t *)spi->priv;
        if (spi_priv->tx_dma_ch >= 0)
        {
            hosal_dma_chan_release(spi_priv->tx_dma_ch);
        }
        if (spi_priv->rx_dma_ch >= 0)
        {
            hosal_dma_chan_release(spi_priv->rx_dma_ch);
        }
        vPortFree(spi_priv);
    }
    else
    {
        spi_priv_t *spi_priv = (spi_priv_t *)spi->priv;
        vPortFree(spi_priv);
    }
    bl_irq_disable(SPI_IRQn);
    SPI_DeInit(0);
    return 0;
}

static int hosal_spi_send(hosal_spi_dev_t *spi, const uint8_t *data, uint16_t size, uint32_t timeout)
{
    int ret;

    if (NULL == spi || data == NULL)
    {
        blog_error("not init.\r\n");
        return -1;
    }

    if (data == NULL)
    {
        blog_error("wrong para \r\n");
    }
    if (spi->config.dma_enable)
    {
        ret = hosal_spi_dma_trans(spi, (uint8_t *)data, NULL, size, timeout);
    }
    else
    {
        ret = hosal_spi_trans(spi, (uint8_t *)data, NULL, size, timeout);
    }
    return ret;
}

static int hosal_spi_recv(hosal_spi_dev_t *spi, uint8_t *data, uint16_t size, uint32_t timeout)
{
    int ret;

    if (NULL == spi || data == NULL)
    {
        blog_error("not init.\r\n");
        return -1;
    }

    if (data == NULL)
    {
        blog_error("wrong para \r\n");
    }
    if (spi->config.dma_enable)
    {
        ret = hosal_spi_dma_trans(spi, NULL, data, size, timeout);
    }
    else
    {
        ret = hosal_spi_trans(spi, NULL, data, size, timeout);
    }
    return ret;
}

static int hosal_spi_send_recv(hosal_spi_dev_t *spi, uint8_t *tx_data, uint8_t *rx_data, uint16_t size, uint32_t timeout)
{
    int ret;
    if (NULL == spi || tx_data == NULL || rx_data == NULL)
    {
        blog_error("not init.\r\n");
        return -1;
    }
    if (spi->config.dma_enable)
    {
        ret = hosal_spi_dma_trans(spi, (uint8_t *)tx_data, (uint8_t *)rx_data, size, timeout);
    }
    else
    {
        ret = hosal_spi_trans(spi, tx_data, rx_data, size, timeout);
    }
    return ret;
}

typedef struct
{
    aiio_spi_enum_t aiio_spi_port;
    aiio_spi_pin_cfg_t aiio_spi_cfg;
    hosal_spi_dev_t aiio_spi_dev;
} aiio_spi_struct;

static aiio_spi_struct aiio_spi_list[4];
static uint8_t aiio_spi_num = 0;

static int32_t aiio_spi_cfg_copy(aiio_spi_pin_cfg_t *aiio_spi_source_cfg, aiio_spi_pin_cfg_t *aiio_spi_target_cfg)
{
    if ((aiio_spi_source_cfg == NULL) || (aiio_spi_target_cfg == NULL))
    {
        return AIIO_ERROR;
    }

    aiio_spi_source_cfg->aiio_gpio_clk_port = aiio_spi_target_cfg->aiio_gpio_clk_port;
    aiio_spi_source_cfg->aiio_gpio_clk_pin = aiio_spi_target_cfg->aiio_gpio_clk_pin;
    aiio_spi_source_cfg->aiio_gpio_mosi_port = aiio_spi_target_cfg->aiio_gpio_mosi_port;
    aiio_spi_source_cfg->aiio_gpio_mosi_pin = aiio_spi_target_cfg->aiio_gpio_mosi_pin;
    aiio_spi_source_cfg->aiio_gpio_miso_port = aiio_spi_target_cfg->aiio_gpio_miso_port;
    aiio_spi_source_cfg->aiio_gpio_miso_pin = aiio_spi_target_cfg->aiio_gpio_miso_pin;
    aiio_spi_source_cfg->aiio_gpio_cs_port = aiio_spi_target_cfg->aiio_gpio_cs_port;
    aiio_spi_source_cfg->aiio_gpio_cs_pin = aiio_spi_target_cfg->aiio_gpio_cs_pin;

