Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/spi/aiio_spi.c
    return AIIO_OK;
}

static int32_t aiio_spi_cfg_cal(aiio_spi_pin_cfg_t *aiio_spi_cfg)
{

    return AIIO_FUNC_FAIL;
}

static int32_t aiio_spi_port_cal(aiio_spi_enum_t aiio_spi_port)
{
    uint8_t i = 0;

    for (i = 0; i < aiio_spi_num; i++)
    {
        if (aiio_spi_list[i].aiio_spi_port == aiio_spi_port)
        {
            return i;
        }
    }

    return AIIO_FUNC_FAIL;
}

int32_t aiio_spi_master_init(aiio_spi_enum_t aiio_spi_port, aiio_spi_pin_cfg_t *aiio_spi_cfg)
{
    if (aiio_spi_port_cal(aiio_spi_port) != AIIO_FUNC_FAIL)
    {
        aiio_log_e("aiio_spi_master_init function aiio_spi_port is repetition!");
        return AIIO_ERROR;
    }

    switch (aiio_spi_port)
    {
    case AIIO_SPI_0:
        /* spi port set */
        aiio_spi_list[aiio_spi_num].aiio_spi_dev.port = 0;
        aiio_spi_list[aiio_spi_num].aiio_spi_dev.config.mode = HOSAL_SPI_MODE_MASTER;
        aiio_spi_list[aiio_spi_num].aiio_spi_dev.config.dma_enable = 0;
        aiio_spi_list[aiio_spi_num].aiio_spi_dev.config.polar_phase = 0;
        aiio_spi_list[aiio_spi_num].aiio_spi_dev.config.freq = 100000;
        aiio_spi_list[aiio_spi_num].aiio_spi_dev.config.pin_cs = aiio_spi_cfg->aiio_gpio_cs_pin;
        aiio_spi_list[aiio_spi_num].aiio_spi_dev.config.pin_clk = aiio_spi_cfg->aiio_gpio_clk_pin;
        aiio_spi_list[aiio_spi_num].aiio_spi_dev.config.pin_mosi = aiio_spi_cfg->aiio_gpio_mosi_pin;
        aiio_spi_list[aiio_spi_num].aiio_spi_dev.config.pin_miso = aiio_spi_cfg->aiio_gpio_miso_pin;
        hosal_spi_init(&aiio_spi_list[aiio_spi_num].aiio_spi_dev);
        break;

    case AIIO_SPI_1:
        aiio_log_w("aiio_spi_master_init function AIIO_I2C_1 is nonsupport!");
        break;

    case AIIO_SPI_2:
        aiio_log_w("aiio_spi_master_init function AIIO_I2C_2 is nonsupport!");
        break;

    case AIIO_SPI_SOFT:
        aiio_log_w("aiio_spi_master_init function AIIO_I2C_SOFT is nonsupport!");
        break;

    default:
        break;
    }

    aiio_spi_list[aiio_spi_num].aiio_spi_port = aiio_spi_port;
    aiio_spi_cfg_copy(&aiio_spi_list[aiio_spi_num], aiio_spi_cfg);
    aiio_spi_num++;

    return AIIO_OK;
}

int32_t aiio_spi_master_deinit(aiio_spi_enum_t aiio_spi_port)
{
    if (aiio_spi_port_cal(aiio_spi_port) == AIIO_FUNC_FAIL)
    {
        aiio_log_e("aiio_spi_master_deinit function aiio_spi_port is nonsupport!");
        return AIIO_ERROR;
    }

    switch (aiio_spi_port)
    {
    case AIIO_SPI_0:
        hosal_spi_finalize(&aiio_spi_list[aiio_spi_port_cal(aiio_spi_port)].aiio_spi_dev);
        break;

    case AIIO_SPI_1:
        aiio_log_w("aiio_spi_master_deinit function AIIO_SPI_1 is nonsupport!\r\n");
        break;

    case AIIO_SPI_2:
        aiio_log_w("aiio_spi_master_deinit function AIIO_SPI_2 is nonsupport!\r\n");
        break;

    case AIIO_SPI_SOFT:
        aiio_log_w("aiio_spi_master_deinit function AIIO_SPI_SOFT is nonsupport!\r\n");
        break;

    default:
        break;
    }

    return AIIO_OK;
}

int32_t aiio_spi_master_write_and_read(aiio_spi_enum_t aiio_spi_port, uint8_t *send_data, uint8_t *rec_data, uint32_t data_len, uint32_t timeout)
{
    if (aiio_spi_port_cal(aiio_spi_port) == AIIO_FUNC_FAIL)
    {
        aiio_log_e("aiio_spi_master_write_and_read function aiio_spi_port is nonsupport!");
        return AIIO_ERROR;
    }

    switch (aiio_spi_port)
    {
    case AIIO_SPI_0:
        hosal_spi_set_cs(aiio_spi_list[aiio_spi_port_cal(aiio_spi_port)].aiio_spi_dev.config.pin_cs, 0);
        hosal_spi_send_recv(&aiio_spi_list[aiio_spi_port_cal(aiio_spi_port)].aiio_spi_dev, (uint8_t *)send_data, (uint8_t *)rec_data, data_len, timeout);
        hosal_spi_set_cs(aiio_spi_list[aiio_spi_port_cal(aiio_spi_port)].aiio_spi_dev.config.pin_cs, 1);
        break;

    case AIIO_SPI_1:
        aiio_log_w("aiio_spi_master_write_and_read function AIIO_SPI_1 is nonsupport!\r\n");
        break;

    case AIIO_SPI_2:
        aiio_log_w("aiio_spi_master_write_and_read function AIIO_SPI_2 is nonsupport!\r\n");
        break;

    case AIIO_SPI_SOFT:
        aiio_log_w("aiio_spi_master_write_and_read function AIIO_SPI_SOFT is nonsupport!\r\n");
        break;

    default:
        break;
    }

    return AIIO_OK;
}

int32_t aiio_spi_master_write(aiio_spi_enum_t aiio_spi_port, uint8_t *addr, uint32_t addr_len, uint8_t *send_data, uint32_t data_len, uint32_t timeout)
{
    if (aiio_spi_port_cal(aiio_spi_port) == AIIO_FUNC_FAIL)
    {
        aiio_log_e("aiio_spi_master_write function aiio_spi_port is nonsupport!");
        return AIIO_ERROR;
    }

    uint8_t *s_buf = (uint8_t *)malloc(sizeof(uint8_t) * (addr_len + data_len));
    uint8_t *r_buf = (uint8_t *)malloc(sizeof(uint8_t) * (addr_len + data_len));
    for (int i = 0; i < addr_len; i++)
    {
        s_buf[i] = addr[i];
    }
    for (int i = 0; i < data_len; i++)
    {
        s_buf[addr_len + i] = send_data[i];
    }
    switch (aiio_spi_port)
    {
    case AIIO_SPI_0:
        hosal_spi_set_cs(aiio_spi_list[aiio_spi_port_cal(aiio_spi_port)].aiio_spi_dev.config.pin_cs, 0);
        hosal_spi_send_recv(&aiio_spi_list[aiio_spi_port_cal(aiio_spi_port)].aiio_spi_dev, (uint8_t *)s_buf, (uint8_t *)r_buf, data_len + addr_len, 10000);
        hosal_spi_set_cs(aiio_spi_list[aiio_spi_port_cal(aiio_spi_port)].aiio_spi_dev.config.pin_cs, 1);
        free(s_buf);
        free(r_buf);
        break;

    case AIIO_SPI_1:
        aiio_log_e("aiio_spi_master_write function AIIO_SPI_1 is nonsupport!\r\n");
        break;

    case AIIO_SPI_2:
        aiio_log_e("aiio_spi_master_write function AIIO_SPI_2 is nonsupport!\r\n");
        break;

    case AIIO_SPI_SOFT:
        aiio_log_e("aiio_spi_master_write function AIIO_SPI_SOFT is nonsupport!\r\n");
        break;

    default:
        aiio_log_e("aiio_spi_master_read function AIIO_SPI_SOFT is nonsupport!");
        break;
    }

    return AIIO_OK;
}

int32_t aiio_spi_master_write_byte(aiio_spi_enum_t aiio_spi_port, uint8_t *addr, uint32_t addr_len, uint8_t send_data, uint32_t timeout)
{
    if (aiio_spi_port_cal(aiio_spi_port) == AIIO_FUNC_FAIL)
    {
        aiio_log_e("aiio_spi_master_write_byte function aiio_spi_port is nonsupport!");
        return AIIO_ERROR;
    }

    if (aiio_spi_master_write(aiio_spi_port, addr, addr_len, &send_data, 1, timeout) != AIIO_OK)
    {
        return AIIO_ERROR;
    }

