Ai-Thinker-Open/aithinker_dev_open_sdk/adt/adt_os/adapter_chip/chip/port/bl602/peripheral_drive/spi/aiio_spi.c
    return AIIO_OK;
}

int32_t aiio_spi_master_read(aiio_spi_enum_t aiio_spi_port, uint8_t *addr, uint32_t addr_len, uint8_t *rec_data, uint32_t data_len, uint32_t timeout)
{
    if (aiio_spi_port_cal(aiio_spi_port) == AIIO_FUNC_FAIL)
    {
        aiio_log_e("aiio_spi_master_read function aiio_spi_port is nonsupport!");
        return AIIO_ERROR;
    }

    uint8_t *s_buf = (uint8_t *)malloc(sizeof(uint8_t) * (addr_len + data_len));
    uint8_t *r_buf = (uint8_t *)malloc(sizeof(uint8_t) * (addr_len + data_len));
    for (int i = 0; i < addr_len; i++)
    {
        s_buf[i] = addr[i];
    }
    switch (aiio_spi_port)
    {
    case AIIO_SPI_0:
        hosal_spi_set_cs(aiio_spi_list[aiio_spi_port_cal(aiio_spi_port)].aiio_spi_dev.config.pin_cs, 0);
        hosal_spi_send_recv(&aiio_spi_list[aiio_spi_port_cal(aiio_spi_port)].aiio_spi_dev, (uint8_t *)s_buf, (uint8_t *)r_buf, data_len + addr_len, 10000);
        hosal_spi_set_cs(aiio_spi_list[aiio_spi_port_cal(aiio_spi_port)].aiio_spi_dev.config.pin_cs, 1);
        for (int i = 0; i < data_len; i++)
        {
            rec_data[i] = r_buf[i + addr_len];
        }
        free(s_buf);
        free(r_buf);
        break;

    case AIIO_SPI_1:
        aiio_log_e("aiio_spi_master_read function AIIO_SPI_1 is nonsupport!");
        break;

    case AIIO_SPI_2:
        aiio_log_e("aiio_spi_master_read function AIIO_SPI_2 is nonsupport!");
        break;

    case AIIO_SPI_SOFT:
        aiio_log_e("aiio_spi_master_read function AIIO_SPI_SOFT is nonsupport!");
        break;

    default:
        aiio_log_e("aiio_spi_master_read function AIIO_SPI_SOFT is nonsupport!");
        break;
    }

    return AIIO_OK;
}

int32_t aiio_spi_master_read_byte(aiio_spi_enum_t aiio_spi_port, uint8_t *addr, uint32_t addr_len, uint8_t *rec_data, uint32_t timeout)
{
    if (aiio_spi_port_cal(aiio_spi_port) == AIIO_FUNC_FAIL)
    {
        aiio_log_e("aiio_spi_master_read_byte function aiio_spi_port is nonsupport!");
        return AIIO_ERROR;
    }

    if (aiio_spi_master_read(aiio_spi_port, addr, addr_len, rec_data, 1, timeout) != AIIO_OK)
    {
        return AIIO_ERROR;
    }

    return AIIO_OK;
}
